---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.SpatialFieldManager
source: html/f9619c41-0e3a-0182-b130-8c73ac0aa546.htm
---
# SpatialFieldManager Members

Creates empty analysis results primitive not associated with any geometry element